<a href="https://colab.research.google.com/github/Ziyahh22/Project-/blob/master/Assignment3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![Assignment2](https://raw.githubusercontent.com/Ziyahh22/Project-/master/GroupAssignment2..1drawio.png)

In [39]:
%load_ext sql
%sql sqlite:///mall.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @mall.db'

In [81]:
%%sql  
DROP TABLE IF EXISTS Mall;
create table Mall (MallID text PRIMARY KEY, Name text, Street text, City text, Zip text, State text, Shop text, Attraction text, Event text);

DROP table IF EXISTS Shop;
create table Shop (ShopID text PRIMARY KEY, Name text, Location text, Type text, Transactions text, OpenHours text);

DROP table IF EXISTS Attraction;
create table Attraction (AttractionID text PRIMARY KEY, Name text, Location text, Type text, OpenHours text);

DROP table IF EXISTS Transactions;
create table Transactions (TransactionID text PRIMARY KEY, Date text, Satus text, Price real, Type text, Orders text);

DROP TABLE IF EXISTS Buyer;
create table Buyer (BuyerID text PRIMARY KEY, FirstName text, LastName text, DOB text, Street text, Zip text, City text, State text, Email text, Orders text);

DROP TABLE IF EXISTS Event;
create table Event (EventID text PRIMARY KEY, Name text, Date text, Time text, Location text, Type text);

 * sqlite:///mall.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [41]:
%%sql 
DROP TABLE IF EXISTS Orders;
create table Orders (TransactionID text, BuyerID text, PRIMARY KEY (TransactionID, BuyerID));

 * sqlite:///mall.db
Done.
Done.

[]

In [ ]:
%%sql
INSERT INTO Mall VALUES('8015', 'Mall Of America', '60EBroadway', 'Bloomington', '55425', 'Minnesota','100', '20','15');

INSERT INTO Shop VALUES ('9843', 'Abercrombie&Fitch', 'A2', 'Clothing', '1457', '11-8');
INSERT INTO Shop VALUES ('5467', 'American Eagle', 'E3', 'Clothing', '2098', '11-8');
INSERT INTO Shop VALUES ('8545', 'Rio cafe', 'B6', 'Food', '5687', '11-8');
INSERT INTO Shop VALUES ('3425', 'Apple', 'D4', 'Tech', '4365', '11-8');
INSERT INTO Shop VALUES ('3425', 'Starbucks cafe', 'D2', 'Food', '4345', '11-8');
INSERT INTO Shop VALUES ('7547', 'Disney', 'E5', 'Clothing & Acessories', '2365', '11-8');

INSERT INTO Attraction VALUES('3142','Nickelodeon Universe', 'A1', 'Theme Park', '11-8');
INSERT INTO Attraction VALUES('4356','The Escape Game', 'B1', 'Attraction', '11-10');
INSERT INTO Attraction VALUES('8765','Amazing Mirror Maze', 'C1', 'Attraction', '11-11');
INSERT INTO Attraction VALUES('9674','House of Comedy', 'D1', 'Attraction', '11-7');
INSERT INTO Attraction VALUES('3521','Sea Life Minnesota Aquarium', 'A1', 'Attraction', '11-8');

INSERT INTO Transactions VALUES ('12345789', '2020-10-10', 'entered', 30, 'jean', '1236540');
INSERT INTO Transactions VALUES ('65486523', '2020-10-21', 'entered', 80, 'jacket', '1654340');
INSERT INTO Transactions VALUES ('65162129', '2020-11-13', 'entered', 15, 'shoes', '1981740');
INSERT INTO Transactions VALUES ('15189454', '2020-09-20', 'entered', 20, 'shirt', '9846560');
INSERT INTO Transactions VALUES ('32151323', '2020-11-16', 'entered', 20, 'candle', '1651480');

INSERT INTO Orders VALUES ('JVC', '1236540');
INSERT INTO Orders VALUES ('ADC', '1654340');
INSERT INTO Orders VALUES ('QEW', '1981740');
INSERT INTO Orders VALUES ('LKD', '9846560');
INSERT INTO Orders VALUES ('ODJ', '1651480');

INSERT INTO Buyer VALUES('902345', 'John', 'Smith', '8/13/86', 'Livingston Street', '14536', 'Mariot', 'Tennesee', 'johnsmith@gmail.com', 'Jeans');
INSERT INTO Buyer VALUES('902346', 'Carrie', 'Smith', '4/23/86', 'Livingston Street', '14536', 'Mariot', 'Tennesee', 'carriesmith@gmail.com', 'Candles');
INSERT INTO Buyer VALUES('902234', 'Rafe', 'Mathis', '1/03/90', 'McMurray Street', '15637', 'Vermouth', 'Maryland', 'rafemathis@gmail.com', 'Tshirt Bundle');
INSERT INTO Buyer VALUES('902345', 'Lorna', 'Oleson', '3/21/87', 'James Street', '12431', 'Gerome', 'Ohio', 'lornaoleson@gmail.com', 'Food');
INSERT INTO Buyer VALUES('902345', 'Horna', 'Oleson', '9/26/84', 'James Street', '12431', 'Gerome', 'Ohio', 'hornaoleson@gmail.com', 'Phone');

INSERT INTO Event VALUES('3541', 'Santa Pictures', '2020-12-01', '11:00', 'A1', 'Event');
INSERT INTO Event VALUES('4231', 'Easter Bunny Pictures', '2020-04-01', '11:00', 'A1', 'Event');
INSERT INTO Event VALUES('2415', 'Train Ride', '2020-10-06', '1:00', 'A1', 'Event');
INSERT INTO Event VALUES('4563', 'Food Drive', '2020-9-20', '3:00', 'A1', 'Event');
INSERT INTO Event VALUES('7634', 'Movie Night', '2020-07-30', '10:00', 'A1', 'Event');

In [106]:
%%sql
SELECT Name, Date, Location FROM Event WHERE Date < "2020-12-31"

 * sqlite:///mall.db
Done.

[('Santa Pictures', '2020-12-01', 'A1'),
 ('Easter Bunny Pictures', '2020-04-01', 'A1'),
 ('Train Ride', '2020-10-06', 'A1'),
 ('Movie Night', '2020-07-30', 'A1')]

In [101]:
%%sql
SELECT Name FROM Attraction

 * sqlite:///mall.db
Done.

[('Nickelodeon Universe',),
 ('The Escape Game',),
 ('Amazing Mirror Maze',),
 ('House of Comedy',),
 ('Sea Life Minnesota Aquarium',)]

In [102]:
%%sql
SELECT DISTINCT (NAME) FROM Shop WHERE Name LIKE "%cafe"

 * sqlite:///mall.db
Done.

[('Rio cafe',)]

3 Questions:
1. List names of attractions in mall
2. Find shops that have the name "cafe"
3. List name, date, location of events that are opening before 2020-12-31

The first question gives the names of attractions. The visitors would want to know what attractions are in the mall. The second question tells us which cafes are in the mall, if visitors want to find cafes. The third question provides information about events that are opening before 2020-12-31, so the visitors can find which events they want to attend and see.